data/tests/json/rust_3p_750_5.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   13.764 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    363.26 [#/sec] (mean)
Time per request:       2064.637 [ms] (mean)
Time per request:       2.753 [ms] (mean, across all concurrent requests)
Transfer rate:          46.47 [Kbytes/sec] received
                        62.44 kb/s sent
                        108.91 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       25  549 780.8    123    5229
Processing:    61  467 834.1    135   13632
Waiting:       21  462 831.8    133   13632
Total:         87 1016 1155.5    492   13697

Percentage of the requests served within a certain time (ms)
  50%    492
  66%   1199
  75%   1339
  80%   1558
  90%   2265
  95%   3379
  98%   4490
  99%   5315
 100%  13697 (longest request)
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   13.959 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    358.20 [#/sec] (mean)
Time per request:       2093.797 [ms] (mean)
Time per request:       2.792 [ms] (mean, across all concurrent requests)
Transfer rate:          45.82 [Kbytes/sec] received
                        61.57 kb/s sent
                        107.39 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       28  573 834.7    122    5138
Processing:    52  459 880.7    129   10771
Waiting:       29  457 880.0    128   10771
Total:         99 1032 1244.8    467   11870

Percentage of the requests served within a certain time (ms)
  50%    467
  66%   1191
  75%   1293
  80%   1709
  90%   2429
  95%   3360
  98%   4644
  99%   5914
 100%  11870 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   14.127 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    353.94 [#/sec] (mean)
Time per request:       2118.992 [ms] (mean)
Time per request:       2.825 [ms] (mean, across all concurrent requests)
Transfer rate:          45.28 [Kbytes/sec] received
                        60.83 kb/s sent
                        106.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26  598 916.1    121    7104
Processing:    49  425 791.9    127   12535
Waiting:       28  423 788.4    127   12534
Total:         93 1023 1232.1    487   13625

Percentage of the requests served within a certain time (ms)
  50%    487
  66%   1166
  75%   1258
  80%   1564
  90%   2428
  95%   3579
  98%   5077
  99%   5693
 100%  13625 (longest request)
Run 4:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   16.323 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    306.32 [#/sec] (mean)
Time per request:       2448.381 [ms] (mean)
Time per request:       3.265 [ms] (mean, across all concurrent requests)
Transfer rate:          39.19 [Kbytes/sec] received
                        52.65 kb/s sent
                        91.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       25  536 759.3    125    5126
Processing:    56  460 859.5    136   14375
Waiting:       23  458 857.2    135   14375
Total:         87  996 1174.0    493   14534

Percentage of the requests served within a certain time (ms)
  50%    493
  66%   1204
  75%   1281
  80%   1511
  90%   2287
  95%   3215
  98%   4419
  99%   5327
 100%  14534 (longest request)
Run 5:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   15.744 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    317.58 [#/sec] (mean)
Time per request:       2361.580 [ms] (mean)
Time per request:       3.149 [ms] (mean, across all concurrent requests)
Transfer rate:          40.63 [Kbytes/sec] received
                        54.58 kb/s sent
                        95.21 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       23  578 836.7    121    6118
Processing:    34  435 859.9    125   14517
Waiting:       20  434 859.6    124   14517
Total:         82 1013 1247.2    441   15671

Percentage of the requests served within a certain time (ms)
  50%    441
  66%   1186
  75%   1268
  80%   1592
  90%   2511
  95%   3387
  98%   4561
  99%   5860
 100%  15671 (longest request)
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   18.274 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    273.61 [#/sec] (mean)
Time per request:       2741.126 [ms] (mean)
Time per request:       3.655 [ms] (mean, across all concurrent requests)
Transfer rate:          35.00 [Kbytes/sec] received
                        47.03 kb/s sent
                        82.03 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26  546 750.5    123    5127
Processing:    53  484 1016.0    130   14345
Waiting:       23  482 1015.3    130   14345
Total:         90 1030 1266.5    527   14419

Percentage of the requests served within a certain time (ms)
  50%    527
  66%   1198
  75%   1297
  80%   1574
  90%   2332
  95%   3237
  98%   4283
  99%   5963
 100%  14419 (longest request)
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   10.951 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    456.56 [#/sec] (mean)
Time per request:       1642.713 [ms] (mean)
Time per request:       2.190 [ms] (mean, across all concurrent requests)
Transfer rate:          58.41 [Kbytes/sec] received
                        78.47 kb/s sent
                        136.88 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       27  569 918.3    114    5107
Processing:    55  388 700.7    122    9199
Waiting:       18  386 700.1    122    9199
Total:         83  958 1162.4    476    9284

Percentage of the requests served within a certain time (ms)
  50%    476
  66%   1107
  75%   1225
  80%   1360
  90%   2263
  95%   3277
  98%   5181
  99%   5485
 100%   9284 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   16.327 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    306.24 [#/sec] (mean)
Time per request:       2449.095 [ms] (mean)
Time per request:       3.265 [ms] (mean, across all concurrent requests)
Transfer rate:          39.18 [Kbytes/sec] received
                        52.63 kb/s sent
                        91.81 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       18  579 821.3    125    5122
Processing:    67  420 770.0    130   12085
Waiting:       26  417 768.5    129   12085
Total:         85  998 1152.6    501   13203

Percentage of the requests served within a certain time (ms)
  50%    501
  66%   1183
  75%   1256
  80%   1528
  90%   2360
  95%   3291
  98%   4242
  99%   5233
 100%  13203 (longest request)
Run 4:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   17.586 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    284.31 [#/sec] (mean)
Time per request:       2637.951 [ms] (mean)
Time per request:       3.517 [ms] (mean, across all concurrent requests)
Transfer rate:          36.37 [Kbytes/sec] received
                        48.87 kb/s sent
                        85.24 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       19  614 883.9    115    6156
Processing:    45  421 848.3    121   14882
Waiting:       19  420 848.0    121   14882
Total:         77 1035 1228.7    488   15996

Percentage of the requests served within a certain time (ms)
  50%    488
  66%   1192
  75%   1282
  80%   1599
  90%   2428
  95%   3418
  98%   4586
  99%   5655
 100%  15996 (longest request)
Run 5:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      750
Time taken for tests:   22.727 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    220.00 [#/sec] (mean)
Time per request:       3409.061 [ms] (mean)
Time per request:       4.545 [ms] (mean, across all concurrent requests)
Transfer rate:          28.14 [Kbytes/sec] received
                        37.81 kb/s sent
                        65.96 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       27  579 843.7    122    6134
Processing:    55  453 932.5    128   19534
Waiting:       22  451 931.3    127   19534
Total:         89 1032 1295.3    491   22665

Percentage of the requests served within a certain time (ms)
  50%    491
  66%   1183
  75%   1255
  80%   1541
  90%   2407
  95%   3363
  98%   4618
  99%   6263
 100%  22665 (longest request)